tylertms/dspic33e-sim/src/firmware_runner.c
static bool write_memory_value(Runner* runner, Dspic33* cpu, const FirmwareImage* image,
                               const JsonValue* specification, bool candidate,
                               char* error, size_t error_size) {
    uint32_t address;
    const JsonValue* bytes = json_get(specification, "bytes");
    const JsonValue* words = json_get(specification, "words");
    const JsonValue* value_location = json_get(specification, "value_location");
    const char* space = json_string(entry_field(runner, specification, "space"));
    int64_t repeat_value = 1;
    size_t repeat;
    size_t index;
    if (!mapped_address(runner, specification, candidate, &address, error,
                        error_size) ||
        !field_number(runner, specification, "repeat", 1, &repeat_value) ||
        repeat_value < 1) {
        snprintf(error, error_size, "invalid memory stimulus");
        return false;
    }
    repeat = (size_t)repeat_value;
    if (value_location != NULL) {
        uint32_t location;
        int64_t offset = 0;
        if (!mapped_address(runner, value_location, candidate, &location, error,
                            error_size) ||
            (json_get(specification, "value_location_offset") != NULL &&
             !parse_number(json_get(specification, "value_location_offset"),
                           &offset))) {
            return false;
        }
        for (index = 0u; index < repeat; index++) {
            dspic33_write_word(cpu, address + (uint32_t)index * 2u,
                               (uint16_t)(location + offset));
        }
        return true;
    }
    if (bytes != NULL && bytes->type == JSON_ARRAY) {
        size_t item;
        for (index = 0u; index < repeat; index++) {
            for (item = 0u; item < bytes->as.array.count; item++) {
                int64_t value;
                if (!parse_number(bytes->as.array.items[item], &value) || value < 0 ||
                    value > UINT8_MAX) {
                    snprintf(error, error_size, "invalid byte stimulus");
                    return false;
                }
                dspic33_write_byte(
                    cpu, address + (uint32_t)(index * bytes->as.array.count + item),
                    (uint8_t)value);
            }
        }
        return true;
    }
    if (words == NULL || words->type != JSON_ARRAY) {
        snprintf(error, error_size, "memory stimulus has no values");
        return false;
    }
    for (index = 0u; index < repeat * words->as.array.count; index++) {
        int64_t value;
        if (!parse_number(words->as.array.items[index % words->as.array.count],
                          &value) ||
            value < 0 || value > 0x00ffffff) {
            snprintf(error, error_size, "invalid word stimulus");
            return false;
        }
        if (space != NULL && strcmp(space, "program") == 0) {
            if (!dspic33_load_program_word(cpu, address + (uint32_t)index * 2u,
                                           (uint32_t)value)) {
                snprintf(error, error_size, "program stimulus is out of range");
                return false;
            }
        } else {
            dspic33_write_word(cpu, address + (uint32_t)index * 2u, (uint16_t)value);
        }
    }
    (void)image;
    return true;
}

static bool apply_register(Runner* runner, Dspic33* cpu, const FirmwareImage* image,
                           const JsonValue* specification, bool candidate, char* error,
                           size_t error_size) {
    const char* name = json_string(json_get(specification, "name"));
    const JsonValue* value_entry = json_get(specification, "value");
    const JsonValue* location = json_get(specification, "location");
    int64_t value;
    uint8_t reg;
    uint32_t address;
    if (!register_index(name, &reg)) {
        snprintf(error, error_size, "invalid working register: %s",
                 name == NULL ? "<missing>" : name);
        return false;
    }
    if (value_entry != NULL) {
        if (!parse_number(value_entry, &value)) {
            snprintf(error, error_size, "invalid register stimulus");
            return false;
        }
    } else if (location != NULL && mapped_address(runner, location, candidate, &address,
                                                  error, error_size)) {
        int64_t offset = 0;
        if (json_get(specification, "register_offset") != NULL &&
            !parse_number(json_get(specification, "register_offset"), &offset)) {
            return false;
        }
        value = address + offset;
    } else {
        (void)image;
        return false;
    }
    cpu->w[reg] = (uint16_t)value;
    return true;
}

static bool apply_pin(Dspic33* cpu, const JsonValue* specification, char* error,
                      size_t error_size) {
    const char* name = json_string(json_get(specification, "name"));
    const char* value = json_string(json_get(specification, "value"));
    uint8_t port;
    uint8_t bit;
    uint16_t pins;
    bool high;
    if (!pin_index(name, &port, &bit) || value == NULL) {
        snprintf(error, error_size, "invalid pin stimulus");
        return false;
    }
    high = strcmp(value, "3.3V") == 0 || strcmp(value, "1") == 0;
    pins = cpu->io.gpio[port];
    if (high) {
        pins |= (uint16_t)(1u << bit);
    } else {
        pins &= (uint16_t)~(1u << bit);
    }
    dspic33_gpio_input(cpu, port, pins);
    return true;
}

static bool apply_stimuli_part(Runner* runner, const JsonValue* part, char* error,
                               size_t error_size) {
    const JsonValue* stimuli = json_get(part, "stimuli");
    const JsonValue* values;
    size_t index;
    if (stimuli == NULL) {
        return true;
    }
    values = json_get(stimuli, "memory");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!write_memory_value(
                    runner, &runner->reference, &runner->reference_image,
                    values->as.array.items[index], false, error, error_size) ||
                !write_memory_value(
                    runner, &runner->candidate, &runner->candidate_image,
                    values->as.array.items[index], true, error, error_size)) {
                return false;
            }
        }
    }
    values = json_get(stimuli, "registers");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!apply_register(runner, &runner->reference, &runner->reference_image,
                                values->as.array.items[index], false, error,
                                error_size) ||
                !apply_register(runner, &runner->candidate, &runner->candidate_image,
                                values->as.array.items[index], true, error,
                                error_size)) {
                return false;
            }
        }
    }
    values = json_get(stimuli, "pins");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!apply_pin(&runner->reference, values->as.array.items[index], error,
                           error_size) ||
                !apply_pin(&runner->candidate, values->as.array.items[index], error,
                           error_size)) {
                return false;
            }
        }
    }
    return true;
}

static void reset_pair(Runner* runner) {
    dspic33_reset(&runner->reference, 0u);
    dspic33_reset(&runner->candidate, 0u);
    dspic33_gpio_input(&runner->reference, 1u, 1u);
    dspic33_gpio_input(&runner->candidate, 1u, 1u);
}

