tylertms/dspic33e-sim/src/firmware_runner.c
static bool run_image(Runner* runner, Dspic33* cpu, bool candidate,
                      const JsonValue* call, const JsonValue* stop, char* error,
                      size_t error_size) {
    uint32_t address;
    Dspic33StopReason reason;
    if (call != NULL) {
        if (!mapped_address(runner, call, candidate, &address, error, error_size)) {
            return false;
        }
        cpu->pc = address;
        cpu->call_depth = 0u;
    }
    if (stop != NULL) {
        if (!mapped_address(runner, stop, candidate, &address, error, error_size)) {
            return false;
        }
        reason = dspic33_run_until(cpu, address, 0u);
        if (reason != DSPIC33_STOPPED) {
            snprintf(error, error_size, "%s stopped with %s at 0x%06" PRIx32,
                     candidate ? "candidate" : "reference",
                     dspic33_stop_reason_name(reason), cpu->pc);
            return false;
        }
    } else {
        reason = dspic33_run(cpu, 0u);
        if (reason != DSPIC33_RETURNED) {
            snprintf(error, error_size,
                     "%s stopped with %s at 0x%06" PRIx32 " opcode=0x%06" PRIx32,
                     candidate ? "candidate" : "reference",
                     dspic33_stop_reason_name(reason), cpu->pc,
                     cpu->unsupported_opcode);
            return false;
        }
    }
    return true;
}

static bool compare_registers(Runner* runner, const StepParts* parts, size_t* failures,
                              char* error, size_t error_size) {
    const JsonValue* values = scalar_field(parts, "registers");
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        snprintf(error, error_size, "register observations must be an array");
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* item = values->as.array.items[index];
        const char* name = item->type == JSON_STRING
                               ? json_string(item)
                               : json_string(json_get(item, "name"));
        uint8_t reg;
        int64_t mask = UINT16_MAX;
        int64_t expected;
        bool has_expected = item->type == JSON_OBJECT &&
                            parse_number(json_get(item, "expected"), &expected);
        bool matched;
        if (!register_index(name, &reg)) {
            snprintf(error, error_size, "invalid register observation");
            return false;
        }
        if (item->type == JSON_OBJECT && json_get(item, "mask") != NULL &&
            !parse_number(json_get(item, "mask"), &mask)) {
            return false;
        }
        matched =
            (runner->reference.w[reg] & mask) == (runner->candidate.w[reg] & mask);
        if (has_expected) {
            matched = matched &&
                      (runner->reference.w[reg] & mask) == ((uint16_t)expected & mask);
        }
        runner->comparisons++;
        if (!matched) {
            (*failures)++;
            printf("  register %s: reference=0x%04x candidate=0x%04x", name,
                   runner->reference.w[reg], runner->candidate.w[reg]);
            if (has_expected) {
                printf(" expected=0x%04x", (uint16_t)expected);
            }
            printf("\n");
        }
    }
    return true;
}

static bool compare_memory_item(Runner* runner, const JsonValue* item, size_t* failures,
                                char* error, size_t error_size) {
    uint32_t reference_address;
    uint32_t candidate_address;
    int64_t size_value;
    int64_t mask = -1;
    int64_t expected;
    bool has_expected = parse_number(entry_field(runner, item, "expected"), &expected);
    const char* expected_text = json_string(entry_field(runner, item, "expected"));
    const char* name = json_string(entry_field(runner, item, "name"));
    size_t size;
    size_t index;
    bool matched = true;
    if (!mapped_address(runner, item, false, &reference_address, error, error_size) ||
        !mapped_address(runner, item, true, &candidate_address, error, error_size) ||
        !field_number(runner, item, "size", 0, &size_value) || size_value < 1) {
        snprintf(error, error_size, "invalid memory observation");
        return false;
    }
    size = (size_t)size_value;
    if (entry_field(runner, item, "mask") != NULL &&
        !parse_number(entry_field(runner, item, "mask"), &mask)) {
        return false;
    }
    for (index = 0u; index < size; index++) {
        if (dspic33_read_byte(&runner->reference,
                              reference_address + (uint32_t)index) !=
            dspic33_read_byte(&runner->candidate,
                              candidate_address + (uint32_t)index)) {
            matched = false;
            break;
        }
    }
    if (!has_expected && expected_text != NULL) {
        uint8_t* expected_bytes = malloc(size);
        if (expected_bytes == NULL) {
            snprintf(error, error_size, "cannot allocate expected memory value");
            return false;
        }
        if (!parse_hex_bytes(expected_text, expected_bytes, size)) {
            free(expected_bytes);
            snprintf(error, error_size, "invalid expected memory value");
            return false;
        }
        for (index = 0u; index < size; index++) {
            matched = matched &&
                      dspic33_read_byte(&runner->reference,
                                        reference_address + (uint32_t)index) ==
                          expected_bytes[index] &&
                      dspic33_read_byte(&runner->candidate,
                                        candidate_address + (uint32_t)index) ==
                          expected_bytes[index];
        }
        free(expected_bytes);
    }
    if (has_expected && size <= 4u) {
        uint32_t reference_value = 0u;
        uint32_t candidate_value = 0u;
        for (index = 0u; index < size; index++) {
            reference_value |=
                (uint32_t)dspic33_read_byte(&runner->reference,
                                            reference_address + (uint32_t)index)
                << (index * 8u);
            candidate_value |=
                (uint32_t)dspic33_read_byte(&runner->candidate,
                                            candidate_address + (uint32_t)index)
                << (index * 8u);
        }
        matched =
            matched &&
            (reference_value & (uint32_t)mask) ==
                ((uint32_t)expected & (uint32_t)mask) &&
            (candidate_value & (uint32_t)mask) == ((uint32_t)expected & (uint32_t)mask);
    }
    runner->comparisons++;
    if (!matched) {
        size_t shown = size > 16u ? 16u : size;
        (*failures)++;
        printf("  memory %s: reference@0x%05" PRIx32 "=", name == NULL ? "state" : name,
               reference_address);
        for (index = 0u; index < shown; index++) {
            printf("%02x", dspic33_read_byte(&runner->reference,
                                             reference_address + (uint32_t)index));
        }
        printf(" candidate@0x%05" PRIx32 "=", candidate_address);
        for (index = 0u; index < shown; index++) {
            printf("%02x", dspic33_read_byte(&runner->candidate,
                                             candidate_address + (uint32_t)index));
        }
        if (shown != size) {
            printf("...");
        }
        if (has_expected) {
            printf(" expected=0x%0*" PRIx64, (int)(size * 2u), (uint64_t)expected);
        } else if (expected_text != NULL) {
            printf(" expected=%s", expected_text);
        }
        printf("\n");
    }
    return true;
}

